# SYD DAT 3 Lab 1 - Git and Markdown

## Homework:

#### Setup
* Resolve any installation issues before next class.
* Make sure you have a github profile and created a repo called "SYD_DAT_4"
* Clone the class repo (this one!)
* Review this [code](../labs/Week 1/00_python_refresher.py) for a recap of some Python basics.

#### Communication
* Read [Analyzing the Analyzers](http://cdn.oreillystatic.com/oreilly/radarreport/0636920029014/Analyzing_the_Analyzers.pdf) for a useful look at the different types of data scientists. Write down 5 key points you took away from the article
* Read about some [Markdown Techniques](http://daringfireball.net/projects/markdown/syntax)
* Write a summary of 2 chapters of [The Data Science Handbook](http://www.thedatasciencehandbook.com/) in Markdown and submit a pull request in the Lab Directory

#### Programming
* Complete the lab from class and the additional Exercise below

#### Course Project
* Come up with 5 different ideas for your course project. For each one list:
  * Overview of your idea
  * What data you will use
  * What the outcome is that you are trying to achieve
  * Any ideas of modelling techniques it may involve

**Instructions: copy this file and append your name in the filename, e.g. Homework1_ian_hansel.ipynb.
Then commit this in your local repository, push it to your github account and create a pull request so I can see your work. Remeber if you get stuck to look at the slides going over Fork, Clone, Commit, Push and Pull request.**

# Analyzing the Analyzers

***

### 5 Key Points:

> **1)** There is a lot of miscommunication in the industry about what a Data Scientist is. This is both from the employee side and the employer side. The artcle indicates that the group of individuals when sitting interviews, did not feel they understood the scope of the job from the description.

> **2)** There are a lot of different skillsets associated with Data Scientist. In the self survey conducted by the publishers, it showed how many who identified as Data Researchers where big on Statistics and Math Skills. The zone where Data Scientists often reside (Data Creative and Data Developer), there was a variety of skills identified they are very broad and the large number of differences in the experience of these types of people.

> **3)** Kandel's survey illustrates the 3 broad categories of skillset which we identified in class: These were hacker, scripter and application user. The Hackers who were skilled at programming, scripters at the application of mathematical & statistical techniques, and application users, who were more into the visualisation and higher level analysis of the data, utilising a broad skillset.

> **4)** Successful Data Scientists have a broad set of skills that allow them to build at lease a prototye version of all steps needed to derive insights from data. The best ones often have a very deep understanding of one or two aspects of data science (such as Statistics, Business Communcation, Coding) 

> **5)** The idea of a T-shaped skillset is very interesting. The top of the 'T' representing the breadth of skills across the board, and the vertical bar representing the depth in one particular area. Some ideas that have been put forward the the breadth of skills needed include: Data curation, analytics and visualisation, and networks and infrastructure.

# The Data Science Handbook: Chapter Summaries
***

### Chapter 13 - Diane Wu (Data Scientist at Palantir) 
> Diane stresses the importance of the human-computer symbiosis (i.e. let the computer do what it does best E.g. crunch numbers/models and calculations, and let humans do what they do best, E.g. Interpret models and relationships to extract meaning from which to base a decision/recommendation.

> "Not all interesting problems produce insights, and not all interesting insights can inspire action that causes change". This would come about in data science quite often I suspect. A business may be presented with a problem and in the end, we may not be able to produce a result. Understanding the scope of the issue is crucial to putting a solution forward.

> The skills needed in data science largely depend on what you're wanting to do with it. Regardless, Diane considers the following as very important in the Data Scientist's toolbox
>> Predictive Modelling

>> Business Intelligence

>> A spot in the middle where deeper questions about user behaviour are asked and teased out

> Diane also suggests to approach the development as a data scientist using the T-shaped model (identified above). 

### Chapter 15 - Joe Blitzstein (Professor of Statistics at Harvard University)
> "Much of statisitics is about distinguishing signal from noise, distinguishing valid from invalid signals". Here Joe emphasises that the Data Scientist (and Statistican for that matter), need to be able to discern what relationships are valid. There is a need to understand cause-effect relationships, probabilistic frameworks and content specific intelligence. 

> Expanding on Diane's point of view about the T-shaped model for a data scientist, Joe also states that different people can specialise in different parts of the process. So a team can all have similar top level skillsets (which helps them all to communicate with eachother) and also have different specialisations, which will assist the team to maintain a high performing, outcomes/results driven environment.

> Visualisation, story telling and communcation are critical components of data science. Being able to build articulate visualisations enables users and decision makers to quickly assess models and their results. Often people who make the decisions dont have a lot of time to read the outputs, so being able to assist them with easily interpretable output is crucial to getting the right message across and influence the decision making process.

> Learning data science is like learning a language. It has to be consistently approach. Learn something new everyday. Dont get into the mindset that until you know X,Y,Z you cant work in data science. It is important to have a good foundation, but it's also important to approach the subject matter incrementally. 

>> "All models are wrong, but some are useful" Finding the right model to use is not something that will occur on first try. A good approach is to start of basic and work your way into greater levels of complexity as dictated by the complexity of the problem at hand.

> Knowledge of how the data is compiled is crucial. Something people often forget. This can introduce bias in the result. (eg. self selection bias, question response bias)

# Possible project topics

### Survival Analysis - Using the Cox Regression Modelling framework with L1 regularization (Tibshirani):
> An interesting paper by Rob Tibshirani on the use of the LASSO regularization technique on survival modelling. In particular its use in restricting coefficients in the COX regression model. Aim is to find a suitible dataset which will allow me to apply this method to better understand causal relationships that effect survival. I've just recently been doing some work on survival analysis so I thought this could be a neat application of a powerful method (L1 regularization) in order to build a more interpretable model.
> http://www.google.com.au/url?sa=t&rct=j&q=&esrc=s&source=web&cd=3&ved=0ahUKEwia0MTU1OfLAhUkJaYKHQ5JDdwQFggtMAI&url=http%3A%2F%2Fstatweb.stanford.edu%2F~tibs%2Flasso%2Ffulltext.pdf&usg=AFQjCNF2J96-y6wxvdZ5Yr6Wpop7E_MXNQ&sig2=ahmJxf1u6Nte4Yzm_d2g8Q

### E-M Algorithm - Fitting multivarite models to portfolios in order to calculate VaR and Expected Shortfall:
> No sure if our course will be covering the use of Expectation Maximisation. Its analogy to clustering I find interesting and would like to use it in the implementation of a more robust framework for calculating Value at Risk and Expected shortfall. This could improve the somewhat simplistic and often dangerous approach to VaR calculations under Basel II. I would also like to extend the framework to caluclate expected shortfall for a given portfolio.

### Predicting Insurance - Using demographic and consumer behaviour data to maximise mailout takeup rates of insurance and minimise costs to the company (The CoIL Challenge 2000):
> Being involved in Actuarial Studies, I'd like to re-attempt this competition using more up to date machine learning techniques to see if I could get a better prediction than the winner of this challenge. https://archive.ics.uci.edu/ml/datasets/Insurance+Company+Benchmark+%28COIL+2000%29

### Predicting Credit Card Defaults:
> The following location has a lot of Machine Learning datasets, one of which relates to credit card defaults. In this preject I would go about comparing different methods and their ability to predict probabilities of default. https://archive.ics.uci.edu/ml/datasets/default+of+credit+card+clients

### Algorithmic Trading (Past Kaggle Competition):
> The aim of this competition was to determine the relationship between recent past order book events and future stock price mean reversion following shocks to liquidity. This is a little left of field but algorthmic trading is a fascinating field and would like to explore how I'd go about analysing this data and building a predictive model for trading. https://www.kaggle.com/c/AlgorithmicTradingChallenge

## Exercise Four - Movie Lens Data

In [1]:
# Import panda library
import pandas as pd

In [2]:
# for each occupation in 'users', count the number of occurrences
# Import the file
names_col = ['user_id', 'age', 'gender', 'occupation', 'zip_code'] #define the columns
users = pd.read_table('../labs/Week 1/u.user',
                       sep='|',index_col='user_id',
                       header=None ,
                       names=names_col,
                       dtype={'zip_code':str})

In [3]:
# view the data (first 10 obs)
users.head(10)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703

In [4]:
# for each occupation, calculate the mean age
users.groupby(by=['occupation'])['age'].mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

In [5]:
# for each occupation, calculate the minimum and maximum ages
min_ages = users.groupby(by=['occupation'])['age'].min()
max_ages = users.groupby(by=['occupation'])['age'].max()

In [6]:
min_ages # View data

occupation
administrator    21
artist           19
doctor           28
educator         23
engineer         22
entertainment    15
executive        22
healthcare       22
homemaker        20
lawyer           21
librarian        23
marketing        24
none             11
other            13
programmer       20
retired          51
salesman         18
scientist        23
student           7
technician       21
writer           18
Name: age, dtype: int64

In [7]:
max_ages # view data

occupation
administrator    70
artist           48
doctor           64
educator         63
engineer         70
entertainment    50
executive        69
healthcare       62
homemaker        50
lawyer           53
librarian        69
marketing        55
none             55
other            64
programmer       63
retired          73
salesman         66
scientist        55
student          42
technician       55
writer           60
Name: age, dtype: int64

In [8]:
# for each combination of occupation and gender, calculate the mean age
users.groupby(['occupation','gender'])['age'].mean()

occupation     gender
administrator  F         40.638889
               M         37.162791
artist         F         30.307692
               M         32.333333
doctor         M         43.571429
educator       F         39.115385
               M         43.101449
engineer       F         29.500000
               M         36.600000
entertainment  F         31.000000
               M         29.000000
executive      F         44.000000
               M         38.172414
healthcare     F         39.818182
               M         45.400000
homemaker      F         34.166667
               M         23.000000
lawyer         F         39.500000
               M         36.200000
librarian      F         40.000000
               M         40.000000
marketing      F         37.200000
               M         37.875000
none           F         36.500000
               M         18.600000
other          F         35.472222
               M         34.028986
programmer     F         32.166667
               M         33.216667
retired        F         70.000000
               M         62.538462
salesman       F         27.000000
               M         38.555556
scientist      F         28.333333
               M         36.321429
student        F         20.750000
               M         22.669118
technician     F         38.000000
               M         32.961538
writer         F         37.631579
               M         35.346154
Name: age, dtype: float64

In [9]:
# randomly sample a DataFrame
sample_n = users.sample(n=50)

In [10]:
sample_n.shape # confirm sample size (expecting 50 x 4)

(50, 4)

In [11]:
# detect duplicate users
# first lets sum the number of duplicates that result in True
sum(users.duplicated())

7

In [12]:
dups = users[users.duplicated()==True] # subset where the duplicate flag is true

In [13]:
dups # view data

         age gender occupation zip_code
user_id
496       21      F    student    55414
572       51      M   educator    20003
621       17      M    student    60402
684       28      M    student    55414
733       44      F      other    60630
805       27      F      other    20009
890       32      M    student    97301

In [14]:
dups.shape # check dims

(7, 4)

In [15]:
uniques = users[users.duplicated()==False] # look at the unique values and check dims for clarification

In [16]:
uniques.shape #check dims

(936, 4)

In [17]:
users.shape #Should have all observations so check original shape

(943, 4)

## Exercises from the lab (Week 1) 
### Using the drinks dataset

In [18]:
drinks = pd.read_csv('../labs/Week 1/drinks.csv') #import
drinks.head(10)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
5,Antigua & Barbuda,102,128,45,4.9,NaN
6,Argentina,193,25,221,8.3,SA
7,Armenia,21,179,11,3.8,EU
8,Australia,261,72,212,10.4,OC
9,Austria,279,75,191,9.7,EU

In [19]:
# filter DataFrame to only include European countries
euro = drinks[drinks.continent=='EU']
euro.head(10)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
1,Albania,89,132,54,4.9,EU
3,Andorra,245,138,312,12.4,EU
7,Armenia,21,179,11,3.8,EU
9,Austria,279,75,191,9.7,EU
10,Azerbaijan,21,46,5,1.3,EU
15,Belarus,142,373,42,14.4,EU
16,Belgium,295,84,212,10.5,EU
21,Bosnia-Herzegovina,76,173,8,4.6,EU
25,Bulgaria,231,252,94,10.3,EU
42,Croatia,230,87,254,10.2,EU

In [20]:
# filter DataFrame to only include European countries with wine_servings > 300
euro_wine = euro[euro.wine_servings > 300]
euro_wine.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
3,Andorra,245,138,312,12.4,EU
61,France,127,151,370,11.8,EU
136,Portugal,194,67,339,11.0,EU

In [21]:
# alternative approach
drinks[(drinks.continent == 'EU') & (drinks.wine_servings > 300)]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
3,Andorra,245,138,312,12.4,EU
61,France,127,151,370,11.8,EU
136,Portugal,194,67,339,11.0,EU

In [22]:
# calculate the average 'beer_servings' for all of Europe
drinks[drinks.continent =='EU'].beer_servings.mean()

193.77777777777777

In [23]:
# determine which 10 countries have the highest total_litres_of_pure_alcohol
# Sort the data and take the head
drinks.sort_values(by='total_litres_of_pure_alcohol',ascending=False).head(10)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
15,Belarus,142,373,42,14.4,EU
98,Lithuania,343,244,56,12.9,EU
3,Andorra,245,138,312,12.4,EU
68,Grenada,199,438,28,11.9,NaN
45,Czech Republic,361,170,134,11.8,EU
61,France,127,151,370,11.8,EU
141,Russian Federation,247,326,73,11.5,AS
81,Ireland,313,118,165,11.4,EU
155,Slovakia,196,293,116,11.4,EU
99,Luxembourg,236,133,271,11.4,EU

In [24]:
# rename the column 'beer_servings' to 'beer'
drinks.rename(columns={'beer_servings': 'beer'},inplace=True)
drinks.rename(columns={'wine_servings': 'wine'},inplace=True)
drinks.rename(columns={'spirit_servings': 'spirits'},inplace=True)

In [25]:
# add a new column as a function of existing columns, total_servings = beer + wine + spirits
drinks['total_servings'] = drinks.beer + drinks.wine + drinks.spirits
drinks.head()

,country,beer,spirits,wine,total_litres_of_pure_alcohol,continent,total_servings
0,Afghanistan,0,0,0,0.0,AS,0
1,Albania,89,132,54,4.9,EU,275
2,Algeria,25,0,14,0.7,AF,39
3,Andorra,245,138,312,12.4,EU,695
4,Angola,217,57,45,5.9,AF,319

In [26]:
# remove the column you just added
del drinks['total_servings']

In [27]:
# check the column is gone
drinks.head()

       country  beer  spirits  wine  total_litres_of_pure_alcohol continent
0  Afghanistan     0        0     0                           0.0        AS
1      Albania    89      132    54                           4.9        EU
2      Algeria    25        0    14                           0.7        AF
3      Andorra   245      138   312                          12.4        EU
4       Angola   217       57    45                           5.9        AF